In [3]:
# Add Remove Columns
import pandas as pd

In [4]:
people = {
    "first": ["Corey",'Jane','John'], 
    "last": ["Schafer",'Doe','Doe'], 
    "email": ["CoreyMSchafer@gmail.com",'JaneDoe@email.com','JohnDoe@email.com']
}

In [6]:
df = pd.DataFrame(people)

In [8]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [10]:
# Add First namd and last name
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [13]:
# Add First namd and last name to a new columum named 'full_name'
df['full_name'] = df['first'] + ' ' + df['last']

In [15]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [18]:
# Removing Columns usig Drop Method, 
df.drop(columns=['first','last'])

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [21]:
# Removing Columns usig Drop Method, use inplace for permanent change in df
df.drop(columns=['first','last'],inplace=True)
df

KeyError: "['first' 'last'] not found in axis"

In [23]:
# Retrieving back the colums by splitting full name
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [26]:
#Split a column in two columns through space character using str.split
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [28]:
#Split a column in two columns through space character using str.split with assigment
df[['first','last']] = df['full_name'].str.split(' ', expand=True)
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [31]:
# Add a new row
df.append({'first':'Tony'}, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [35]:
people = {
    "first": ["Tony",'Steve',], 
    "last": ["Stark",'Rogers',], 
    "email": ["Tironman@avenger.com",'Cap@avenger.com']
}
df2 = pd.DataFrame(people)
df2

   first    last                 email
0   Tony   Stark  Tironman@avenger.com
1  Steve  Rogers       Cap@avenger.com

In [51]:
# Adding df2 in df1
df = df.append(df2,ignore_index=True)
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3     Tironman@avenger.com            NaN   Tony    Stark
4          Cap@avenger.com            NaN  Steve   Rogers

In [54]:
# Removing Rows
df.drop(index=4)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3     Tironman@avenger.com            NaN   Tony    Stark

In [71]:
#df.drop(index=df[df['last'] == 'Doe'])
df.drop(index=df[df['last'] == 'Doe'].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3     Tironman@avenger.com            NaN   Tony    Stark
4          Cap@avenger.com            NaN  Steve   Rogers

In [73]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3     Tironman@avenger.com            NaN   Tony    Stark
4          Cap@avenger.com            NaN  Steve   Rogers

In [75]:
# Use Filter to avoid complication
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3     Tironman@avenger.com            NaN   Tony    Stark
4          Cap@avenger.com            NaN  Steve   Rogers